
export const data = 
[



	// te

	{
		'form': 'て',

		'chapter': '14',
		
		'group1': {
			
			'i/chi/ri': {

				'rule': 'って',
				
				'examples': [
					'とります -> とって',
					'まちます -> まって',
				]

			},

			'mi/bi': {
				'rule': 'んで',
				
				'examples': [
					'あそびます -> あそんで',
					'よびます -> よんで',
				]
			},

			'ki/gi': {

				'rule': 'いて　/　いで',
				
				'examples': [
					'かきます -> かいて',
					'いそぎます -> いそいで',
				]

			},

			'-': {
				'rule': 'て',
				
				'examples': [
					'はなします -> はなして'
				]
			}
		},

		'group2': {
			'rule': 'て',

			'examples': [
				'たべます -> たべて',
				'おしえます -> おしえて',
				'おきます -> おきて',
				'かります -> かりて',
			]
		},

		'group3': {

			'kimasu': {
				'rule': 'きて',

				'examples': [
					'もってきます -> もってきて',
				]
			},

			'shimasu': {
				'rule': 'して',

				'examples': [
					'べんきょうします -> べんきょうして'
				]
			}
		}
	},





	// nai

	{
		'form': 'ない',

		'chapter': '17',
		
		'group1': {

			'rule': 'あ sound + ない',

			'examples': [
				'いきます -> いかない',
				'のみます -> のまない',
				'あいます -> あわない',
			],

		},

		'group2': {
			'rule': 'ない',

			'examples': [
				'たべます -> たべない',
				'とめます -> とめない',
				'みます -> みない',
				'かります -> かりない',
			]
		},

		'group3': {

			'kimasu': {
				'rule': 'こない',

				'examples': [
					'もってきます -> もってこない',
				]
			},

			'shimasu': {
				'rule': 'しない',

				'examples': [
					'べんきょうします -> ばんきょうしない'
				]
			}
		}
	},



];